{
  "basics": {
    "name": "Noel Chen",
    "label": "Web Developer",
    "image": "https://pbs.twimg.com/profile_images/459521530938920960/HTVvQUUG_400x400.jpeg",
    "email": "terrorer9999@hotmail.com",
    "url": "http://blog.noelchen.tw/",
    "summary": "Hi, I'm Noel, an experienced web developer, who mainly uses Ruby on Rails to create great product. I always take writing clean and beautiful code to make people happier as my goal. Also, I am desperate to dig out any useful and meaningful things to make life solid.",
    "location": {
      "address": "",
      "postalCode": "108",
      "city": "Taipei",
      "countryCode": "TW",
      "region": "Wanhua Dist"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "noel9999",
        "url": "http://github.com/noel9999"
      }
    ]
  },
  "work": [
    {
      "name": "Snapask",
      "position": "Senior backend developer",
      "url": "https://sofasoda.com/zh-TW/",
      "startDate": "2018-11-29",
      "description": "Career transformation starts at sofasoda",
      "highlights": [
        "Build one time purchase and subscriptions system to allow users to access the learing resources on our platform.",
        "Build coupon and promotion system to apply different kinds of discount when purchasing.",
        "Build online shop for selling digital courses and cousulting service in the form of bundle pacakge.",
        "Build video course platform which allows users to watch video courses or particiate in a living course.",
        "Build 1 on 1 consulting service which allows users to make an appointemt with the mentor for career consultation.",
        "Build appointment question system for students to ask an question for a mentor at a specific time.",
        "Build resume generator system which help users to build his/her own customized resume pdf.",
        "Build chat room by using PUBNUB which is a service that provides the functionality based on real-time communication.",
        "Build notification system to notify event/system messages to users throug mails, sms, and on site notfication.",
        "Build log tracking system which allows data team or customer service staff to check what activities of an object it might been through.",
        "Integrate ezpay and neweb with our payment system.",
        "Write RSpec for all functions as above."
      ]
    },
    {
      "name": "Shopline",
      "position": "Web Developer",
      "url": "https://shopline.tw/",
      "startDate": "2017-03-15",
      "endDate": "2018-06-30",
      "description": "The Easiest Online Shop Builder in Asia",
      "highlights": [
        "Integrate with TCat to create objects that provide the utility to update delivery information and generate delivery order file.",
        "Use Grape to build lightwrighy API for the third party and manage its library dependecy by follow Rails style.",
        "Use Doorkeeper to build customerized Auth Service to support the API that available for the public.",
        "Use Rspec to write test for complicated logic such as order checkout or the function that needs the support from outside world."
      ]
    },
    {
      "name": "commandp",
      "position": "Web Developer",
      "url": "https://commandp.com/",
      "startDate": "2014-11-03",
      "endDate": "2017-01-26",
      "description": "commandp is a start-up that helps individuals to create their own customized products such as phone case, t-shirt, and etc.",
      "highlights": [
        "Use RJS and jQuery to build the internal system interface for admin and shop.",
        "Use AASM to manage the status and activity of an order.",
        "Build the utlity to manage kinds of price promotions.",
        "Use Pundit to provide auth service to manage third party when using internal system.",
        "Write RESTful API for mobile and front end.",
        "Create kinds of service objects and form objects to support commercial needs.",
        "Create daily task to dump requird data and display it with forms by C3.js.",
        "Intergate with thrid party API like Stripe, Mailgun, SMS King, Zendesk, and Emay etc.",
        "Write test for any kinds of backend utlity by following TDD.",
        "Help and support front end developers to build universal javascript url from Rails."
      ]
    },
    {
      "name": "UrCosme",
      "position": "Web Developer",
      "url": "https://www.urcosme.com/",
      "startDate": "2013-08-01",
      "endDate": "2014-08-31",
      "description": "UrCosme is a SNS for cosme products",
      "highlights": [
        "Create admin app for manage users, products, categories, and so on.",
        "Create a channel BeautyBuizz for display highlights posts.",        
        "Create an internal app that generates customerized event sites."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "RailsGirl",
      "position": "Coach",
      "website": "http://railsgirls.tw/",
      "startDate": "2014-03-01",
      "endDate": "2014-12-31",
      "summary": "Learn how web apps work at Ruby on Rails Workshop for Girls.",
      "highlights": [
        "Experience a trip to lead people into Rails world."
      ]
    }
  ],
  "education": [
    {
      "institution": "Fu Jen Catholic University",
      "area": "Management Information Systems, General",
      "studyType": "Bachelor",
      "startDate": "2006-09-15",
      "endDate": "2010-06-19",
      "gpa": "",
      "courses": [
        "",
        ""
      ]
    },
    {
      "institution": "National Tsing Hua University",
      "area": "Service Science",
      "studyType": "Master Of Business Administration",
      "startDate": "2011-09-13",
      "endDate": "2013-07-27",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "Senior",
      "keywords": [
        "HTML",
        "Bootstrap",
        "JQuery",
        "Javascript",
        "CoffeeScript",
        "Node.js/ Express.js",
        "Ruby",
        "Rails",
        "Sinatra",
        "Redis",
        "Postgresql",
        "RSpec",
        "Statistics"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "TOEIC 720"
    }
  ],
  "interests": [
    {
      "name": "Footbll",
      "keywords": [
        "Manchester United"
      ]
    },
    {
      "name": "Movie",
      "keywords": [
        "Star Wars"
      ]
    },
    {
      "name": "Music",
      "keywords": [
        "Oasis",
        "Beatles"
      ]
    }
  ],
  "references": []
}
